content/mysql.org
#+TITLE: MySql
#+OPTIONS: num:nil
#+SETUPFILE: /home/silin/.emacs.d/org-html-themes/org/theme-readtheorg.setup
#+STARTUP: content
* configuation
** 安装
*** install
#+begin_src 
sudo apt install mysql-server
sudo mysql_secure_installation
#+end_src

此时是给电脑的root用户，创建了一个mysql里root用户的数据库
*** 电脑的root用户
sudo apt install mysql-server
sudo mysql_secure_installation
*** sudo
上面默认设置的是电脑root用户的密码，也就是说只能 sudo 登陆 : sudo mysql -u root -p
create new user  后可以用非sudo 登录
*** with password
关闭无密码登录
#+begin_src 
USE mysql;
UPDATE user SET plugin='mysql_native_password' WHERE User='root';
FLUSH PRIVILEGES;
exit;
#+end_src
sudo systemctl restart mysql.service
sudo mysql_secure_installation

*** remote connect
sudo nano /etc/mysql/mysql.conf.d/mysqld.cnf
# Instead of skip-networking the default is now to listen only on
# localhost which is more compatible and is not less secure.
bind-address = 127.0.0.1
*** Chinese
对该 my.ini 文件下进行配置修改 ：
#+begin_src
[client]
default-character-set = utf8

[mysql]
default-character-set = utf8

[mysqld]
character-set-client-handshake = FALSE
character-set-server = utf8
collation-server = utf8_unicode_ci
init_connect=’SET NAMES utf8’
#+end_src

*** Plugin is not loaded
if  Plugin ***** is not loaded:  修改mysql.cnf 在 [mysqld]下添加skip-grant-tables
*** 电脑的普通用户进入配置 This is not needed

|------+--------------------------+---------------------------------------------------+--------------------------------------|
| step | env                      | command                                           | explain                              |
|   01 | terminal                 | sudo mysql -u root -p                             | 电脑root进入mysql的root              |
|   02 | mysql                    | select User, Host, plugin from user;              | 获取                                 |
|   03 | mysql                    | update user set plugin='mysql_ native_ password'; |                                      |
|   04 | mysql                    | select User, Host, plugin from user;              | 获取                                 |
|   05 | mysql                    | flush privileges;                                 | 权限更新 in mysqld:skip-grant-tables |
|   06 | mysql [fn:nopasswordset] | C-d C-d                                           | 退出                                 |
|   07 | terminal                 | mysql -u root    BUT NOT (mysql -u root -p)       | 不能 -p, 密码为空，直接Enter进入     |
|   08 | mysql                    | set password for root@localhost = '123'           | 老版本  = password('123');           |
|   09 | error                    | 123 is too simple, just not satisfy the           | check the password requirement.      |
|   10 | mysql                    | show variables like 'validate_ password%';        | 显示密码设置要求                     |
|   11 | mysql                    | set global validate_ password_ length=3;          | 设置密码长度要求 为 3                |
|   12 | mysql                    | set global validate_ password_ policy=0;          | 设置密码要求概要  为 0               |
|   13 | mysql                    | set password for root@localhost = '123'           | 老版本  = password('123');           |
|   14 | mysql                    | flush privileges;                                 | 权限更新 in mysqld:skip-grant-tables |
|   15 | terminal                 | mysql -u root -p                                  | 密码 123 , 登陆时不需要 sudo 开头    |
|------+--------------------------+---------------------------------------------------+--------------------------------------|

** 给数据库添加用户
在进入数据库的root后，mysql 添加普通用户 [[https://www.jianshu.com/p/d7b9c468f20d][简书连接]] .

create USER 'sx'@'localhost' IDENTIFIED BY 'scofild';
创建sx用户，只能本地连接，秘密scofild

GRANT ALL ON testforjava.course TO 'sx'@'localhost';
开放testforjava数据集中的course数据表的所有全线给sx 用户

退出后登陆 sx 用户
mysql -u sx -p 
scofild

便只能看到有权限的数据集

** 查看数据库及添加数据库

show databases;

create databese kurs;

drop databases kurs;

** 中文设置 

| show variables like 'character%'; |
|                                   |


听说mysql的utf8不是真的utf8，需要使用utf8mb4.
在用户登陆后用set charactater server database = utf8 或者utf8mb4， 只要重开接入，设置就复原。
只有在/etc/mysql/中的mysql.cnf中的clint/mysqld/mysql字段加入以上设定，重启生效

| 在[client]下追加 | default-character-set=utf8 |
| 在[mysqld]下追加 | character-set-server=utf8  |
| 在[mysql]下追加  | default-character-set=utf8 |

** 特殊字符
 - 用`ry-vue` 
 create database `ry-vue`;

** execute file 执行sql文件
   mysql -u root  -p xxxx
   use database;
   source .../file.sql 

