mysql.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-02-18 Fri 16:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MySql</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css" />
</head>
<body>
<div id="content">
<h1 class="title">MySql</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org807f018">configuation</a>
<ul>
<li><a href="#org1d134bc">安装</a>
<ul>
<li><a href="#org01a02c3">install</a></li>
<li><a href="#org5e8ce8c">电脑的root用户</a></li>
<li><a href="#org1517068">sudo</a></li>
<li><a href="#orgdddb2fe">with password</a></li>
<li><a href="#org49bbc55">remote connect</a></li>
<li><a href="#org7e64dfb">Chinese</a></li>
<li><a href="#org41a2d30">Plugin is not loaded</a></li>
<li><a href="#orgdec119f">电脑的普通用户进入配置 This is not needed</a></li>
</ul>
</li>
<li><a href="#org14b44d3">给数据库添加用户</a></li>
<li><a href="#orgc6f45c3">查看数据库及添加数据库</a></li>
<li><a href="#orgd4ada89">中文设置</a></li>
<li><a href="#orgea50c23">特殊字符</a></li>
<li><a href="#org7376a20">execute file 执行sql文件</a></li>
<li><a href="#org65b15f2">remote</a></li>
<li><a href="#org6b94b73">reboot</a></li>
</ul>
</li>
<li><a href="#org439b2a5">Operation</a>
<ul>
<li><a href="#org8394e9b">进入数据库</a></li>
<li><a href="#org2ece01b">插入表格</a></li>
<li><a href="#orgfc129f7">插入值</a></li>
<li><a href="#orgc1e7f55">查看表格</a></li>
<li><a href="#org7b04398">编辑表格</a></li>
<li><a href="#org61b41fc">读取内容</a></li>
<li><a href="#org0b02687">高级条件查询</a></li>
<li><a href="#org5986f3f">delete</a></li>
<li><a href="#org4e81ce4">update</a></li>
<li><a href="#orgb9397b4">backup</a></li>
</ul>
</li>
<li><a href="#orge7a5b33">Management</a>
<ul>
<li><a href="#org95993f1">user</a></li>
<li><a href="#org2008876">privileges</a>
<ul>
<li><a href="#org6b29465">creat</a></li>
<li><a href="#orgf68b829">查询</a></li>
<li><a href="#org4b9b50d">授予</a></li>
<li><a href="#org13bfcdc">撤销</a></li>
</ul>
</li>
<li><a href="#org2168437">timezone</a></li>
</ul>
</li>
<li><a href="#org827117b">Operations for SQL</a>
<ul>
<li><a href="#org6208d8a">decripation</a></li>
<li><a href="#orgce26a6a">check the connection in 0812erp</a></li>
<li><a href="#orge460c45">check the database</a></li>
<li><a href="#orgb47efd5">dump database</a></li>
<li><a href="#org7162fbd">delete database</a></li>
<li><a href="#org20265fb">recover testforjava</a></li>
<li><a href="#orgd4a5b7c">Table creation update delete</a></li>
<li><a href="#org8ad155b">add foreign key</a></li>
<li><a href="#orgf368143">left join</a></li>
<li><a href="#orgc9e139c">right join</a></li>
<li><a href="#org35d19ac">inner join</a></li>
<li><a href="#org7f6a07d">full joipn</a></li>
<li><a href="#orgba2473b">many2one</a></li>
<li><a href="#org5ef4614">many2many</a></li>
</ul>
</li>
<li><a href="#orga8db5b3">Operation from the third program language</a>
<ul>
<li><a href="#org459a7ce">singal python file connect with mysql</a></li>
<li><a href="#orga20f590">singal java  file  connect with mysql</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org807f018" class="outline-2">
<h2 id="org807f018">configuation</h2>
<div class="outline-text-2" id="text-org807f018">
</div>
<div id="outline-container-org1d134bc" class="outline-3">
<h3 id="org1d134bc">安装</h3>
<div class="outline-text-3" id="text-org1d134bc">
</div>
<div id="outline-container-org01a02c3" class="outline-4">
<h4 id="org01a02c3">install</h4>
<div class="outline-text-4" id="text-org01a02c3">
<pre class="example">
sudo apt install mysql-server
sudo mysql_secure_installation
</pre>

<p>
此时是给电脑的root用户，创建了一个mysql里root用户的数据库
</p>
</div>
</div>
<div id="outline-container-org5e8ce8c" class="outline-4">
<h4 id="org5e8ce8c">电脑的root用户</h4>
<div class="outline-text-4" id="text-org5e8ce8c">
<p>
sudo apt install mysql-server
sudo mysql<sub>secure</sub><sub>installation</sub>
</p>
</div>
</div>
<div id="outline-container-org1517068" class="outline-4">
<h4 id="org1517068">sudo</h4>
<div class="outline-text-4" id="text-org1517068">
<p>
上面默认设置的是电脑root用户的密码，也就是说只能 sudo 登陆 : sudo mysql -u root -p
create new user  后可以用非sudo 登录
</p>
</div>
</div>
<div id="outline-container-orgdddb2fe" class="outline-4">
<h4 id="orgdddb2fe">with password</h4>
<div class="outline-text-4" id="text-orgdddb2fe">
<p>
关闭无密码登录
</p>
<pre class="example">
USE mysql;
UPDATE user SET plugin='mysql_native_password' WHERE User='root';
FLUSH PRIVILEGES;
exit;
</pre>
<p>
sudo systemctl restart mysql.service
sudo mysql<sub>secure</sub><sub>installation</sub>
</p>
</div>
</div>

<div id="outline-container-org49bbc55" class="outline-4">
<h4 id="org49bbc55">remote connect</h4>
<div class="outline-text-4" id="text-org49bbc55">
<p>
sudo nano /etc/mysql/mysql.conf.d/mysqld.cnf
</p>

<p>
bind-address = 127.0.0.1
</p>
</div>
</div>
<div id="outline-container-org7e64dfb" class="outline-4">
<h4 id="org7e64dfb">Chinese</h4>
<div class="outline-text-4" id="text-org7e64dfb">
<p>
对该 my.ini 文件下进行配置修改 ：
</p>
<pre class="example">
[client]
default-character-set = utf8

[mysql]
default-character-set = utf8

[mysqld]
character-set-client-handshake = FALSE
character-set-server = utf8
collation-server = utf8_unicode_ci
init_connect=’SET NAMES utf8’
</pre>
</div>
</div>

<div id="outline-container-org41a2d30" class="outline-4">
<h4 id="org41a2d30">Plugin is not loaded</h4>
<div class="outline-text-4" id="text-org41a2d30">
<p>
if  Plugin <b><b>*</b></b> is not loaded:  修改mysql.cnf 在 [mysqld]下添加skip-grant-tables
</p>
</div>
</div>
<div id="outline-container-orgdec119f" class="outline-4">
<h4 id="orgdec119f">电脑的普通用户进入配置 This is not needed</h4>
<div class="outline-text-4" id="text-orgdec119f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">step</td>
<td class="org-left">env</td>
<td class="org-left">command</td>
<td class="org-left">explain</td>
</tr>

<tr>
<td class="org-right">01</td>
<td class="org-left">terminal</td>
<td class="org-left">sudo mysql -u root -p</td>
<td class="org-left">电脑root进入mysql的root</td>
</tr>

<tr>
<td class="org-right">02</td>
<td class="org-left">mysql</td>
<td class="org-left">select User, Host, plugin from user;</td>
<td class="org-left">获取</td>
</tr>

<tr>
<td class="org-right">03</td>
<td class="org-left">mysql</td>
<td class="org-left">update user set plugin='mysql_ native_ password';</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">04</td>
<td class="org-left">mysql</td>
<td class="org-left">select User, Host, plugin from user;</td>
<td class="org-left">获取</td>
</tr>

<tr>
<td class="org-right">05</td>
<td class="org-left">mysql</td>
<td class="org-left">flush privileges;</td>
<td class="org-left">权限更新 in mysqld:skip-grant-tables</td>
</tr>

<tr>
<td class="org-right">06</td>
<td class="org-left">mysql <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></td>
<td class="org-left">C-d C-d</td>
<td class="org-left">退出</td>
</tr>

<tr>
<td class="org-right">07</td>
<td class="org-left">terminal</td>
<td class="org-left">mysql -u root    BUT NOT (mysql -u root -p)</td>
<td class="org-left">不能 -p, 密码为空，直接Enter进入</td>
</tr>

<tr>
<td class="org-right">08</td>
<td class="org-left">mysql</td>
<td class="org-left">set password for root@localhost = '123'</td>
<td class="org-left">老版本  = password('123');</td>
</tr>

<tr>
<td class="org-right">09</td>
<td class="org-left">error</td>
<td class="org-left">123 is too simple, just not satisfy the</td>
<td class="org-left">check the password requirement.</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">mysql</td>
<td class="org-left">show variables like 'validate_ password%';</td>
<td class="org-left">显示密码设置要求</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-left">mysql</td>
<td class="org-left">set global validate_ password_ length=3;</td>
<td class="org-left">设置密码长度要求 为 3</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-left">mysql</td>
<td class="org-left">set global validate_ password_ policy=0;</td>
<td class="org-left">设置密码要求概要  为 0</td>
</tr>

<tr>
<td class="org-right">13</td>
<td class="org-left">mysql</td>
<td class="org-left">set password for root@localhost = '123'</td>
<td class="org-left">老版本  = password('123');</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-left">mysql</td>
<td class="org-left">flush privileges;</td>
<td class="org-left">权限更新 in mysqld:skip-grant-tables</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-left">terminal</td>
<td class="org-left">mysql -u root -p</td>
<td class="org-left">密码 123 , 登陆时不需要 sudo 开头</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org14b44d3" class="outline-3">
<h3 id="org14b44d3">给数据库添加用户</h3>
<div class="outline-text-3" id="text-org14b44d3">
<p>
在进入数据库的root后，mysql 添加普通用户 <a href="https://www.jianshu.com/p/d7b9c468f20d">简书连接</a> .
</p>

<p>
create USER 'sx'@'localhost' IDENTIFIED BY 'scofild';
创建sx用户，只能本地连接，秘密scofild
</p>

<p>
GRANT ALL ON testforjava.course TO 'sx'@'localhost';
开放testforjava数据集中的course数据表的所有全线给sx 用户
</p>

<p>
退出后登陆 sx 用户
mysql -u sx -p 
scofild
</p>

<p>
便只能看到有权限的数据集
</p>
</div>
</div>

<div id="outline-container-orgc6f45c3" class="outline-3">
<h3 id="orgc6f45c3">查看数据库及添加数据库</h3>
<div class="outline-text-3" id="text-orgc6f45c3">
<p>
show databases;
</p>

<p>
create databese kurs;
</p>

<p>
drop databases kurs;
</p>
</div>
</div>

<div id="outline-container-orgd4ada89" class="outline-3">
<h3 id="orgd4ada89">中文设置</h3>
<div class="outline-text-3" id="text-orgd4ada89">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">show variables like 'character%';</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>


<p>
听说mysql的utf8不是真的utf8，需要使用utf8mb4.
在用户登陆后用set charactater server database = utf8 或者utf8mb4， 只要重开接入，设置就复原。
只有在/etc/mysql/中的mysql.cnf中的clint/mysqld/mysql字段加入以上设定，重启生效
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">在[client]下追加</td>
<td class="org-left">default-character-set=utf8</td>
</tr>

<tr>
<td class="org-left">在[mysqld]下追加</td>
<td class="org-left">character-set-server=utf8</td>
</tr>

<tr>
<td class="org-left">在[mysql]下追加</td>
<td class="org-left">default-character-set=utf8</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgea50c23" class="outline-3">
<h3 id="orgea50c23">特殊字符</h3>
<div class="outline-text-3" id="text-orgea50c23">
<ul class="org-ul">
<li>用`ry-vue`</li>
</ul>
<p>
create database `ry-vue`;
</p>
</div>
</div>

<div id="outline-container-org7376a20" class="outline-3">
<h3 id="org7376a20">execute file 执行sql文件</h3>
<div class="outline-text-3" id="text-org7376a20">
<p>
mysql -u root  -p xxxx
use database;
source &#x2026;/file.sql 
</p>
</div>
</div>
