content/mysql.org
** remote
alter user 'root'@'localhost' indentified by '110011';
** reboot
sudo systemctl restart mysql

* Operation
** 进入数据库
create databese testforjava;
use testforjava;
** 插入表格
create table course(id int primary key atuo_increment,  kurs_name varchar(50), kurs_length
varchar(50),teacher varchar(50), categeory varchar(50));
for later version, only works for auto_increment, not for identity(m,n)
** 插入值
insert into kurs values(1, 'C++', 23, 'su', 'basic');
insert into kurs values (2, 'Python', 50, 'morvan', 'hard');
insert into kurs values(3, 'CLI', 22, 'su', 'basic');


或者 不完整信息

insert into kurs(id, kurs_name, categeory) values(4, 'java', 'basic'); 
(指定属性给值)
** 查看表格 

show tables;

describe course;
** 编辑表格

alter table course rename kurs;  (重命名)

alter table kurs add link varchar(50); (添加属性，列)

alter table kurs drop column link;   (将该列删除)

alter table kurs modify teacher varchar(100); (修改该列的属性，增加容量)

alter table kurs change column teacher lecture varchar(100); (修改该列的名称，和属性，)

** 读取内容

select * from kurs;

select kurs_name, lecture from kurs;

读取内容时，不重复显示

select distinct lecture from kurs;

** 高级条件查询

select * from course where course_name = 'gnome';

select * from course where course_length > 10;

select * from course where lecture='su' and categeory='adv';
(满足这两个要求的)
select * from course order by  course_length desc;
(由课程长度有小到大排序) 后面加desc 则反序排序
** delete
delete from course where id =2;
delete from table where key=value
** update
update course set lecture = 'Lee'  where id =3;
** backup

mysqldump -u root -p kurs > firstForFun.sql;
(在root下将kurs数据库备份为FirstForFun.sql)

mysql -u root -p kurs < Firstforfun.sql
(将备份文件FirstForFun.sql恢复为kurs数据库)

(此两个语句是在退出sql后的terminal执行的)
* Management
** user

show databases;
use mysql;
show tables;

mysqld --skip-grant-tables (开启mysql的无验证登陆，对于遗失密码后）
select host,user from user; (查看所有用户)

create user 'cloud'@'%' identified by 'password';
drop user 'root'@'%';

rename user si to shi; (将si重命名为shi)
set password = password('new');  (将当前用户密码改为new)
set password for si = password(link); (将si用户密码重置为link)

grant all privileges on **.** to 'cloud'@'%' with grant option;
flush privileges;

** privileges
*** creat
create user shi identified by 'lining';
grant all privileges on **.** to 'shi'@'%' identified by 'lining' with grant option;
flush privileges;

grant all privileges on **.** to 'root'@'%' identified by 'lining';
*** 查询
 show grants for 'newuser'@'localhost'
*** 授予
grants 权限列表 on 数据库名.表明 to '用户'@'主机名'
grants all on *.* 'newuser'@'localhost'
*** 撤销
revoke delete on *.* from 'newuser'@'localhost'

** timezone
set global time_zone = '+8:00';  ##修改mysql全局时区为北京时间，即我们所在的东8区
set time_zone = '+8:00';  ##修改当前会话时区
flush privileges;  #立即生效
* Operations for SQL
** decripation
there can available code to execute,  change the dbhost and dbpassword
** check the connection in 0812erp
#+name: myweb
#+header: :engine mysql
#+header: :dbhost localhost
#+header: :dbuser cloud
#+header: :dbpassword "password"
#+header: :database 0812erp
#+begin_src sql :results output
show tables;
#+end_src

#+RESULTS: myweb
#+begin_example
Tables_in_0812erp
bus_customer
bus_goods
bus_inport
bus_outport
bus_provider
bus_sales
bus_salesback
sys_dept
sys_loginfo
sys_menu
sys_notice
sys_role
sys_role_menu
sys_role_user
sys_user
#+end_example



#+header: :engine mysql
#+header: :dbhost localhost
#+header: :dbuser cloud
#+header: :dbpassword "password"
#+header: :database 0812erp
#+begin_src sql :results output
SELECT * FROM sys_menu          
#+end_src

#+RESULTS:
#+begin_example
id	pid	type	typecode	title	icon	href	target	spread	ordernum	available
1	0	topmenu	business	业务管理	fa fa-newspaper-o		_self	1	2	1
2	0	topmenu	system	系统管理	fa fa-gear		_self	0	1	1
3	1	leftmenu	business	基础数据管理	fa fa-gear		_self	1	3	1
4	1	leftmenu	business	进货管理	fa fa-gear		_self	0	4	1
5	1	leftmenu	business	销售管理	fa fa-gear		_self	0	5	1
6	3	leftmenu	business	客户管理	fa fa-gear	resources/page/business/customer/customerManager.html	_self	0	6	1
7	3	leftmenu	business	供应商管理	fa fa-gear	resources/page/business/provider/providerManager.html	_self	0	7	1
8	3	leftmenu	business	商品管理	fa fa-gear	resources/page/business/goods/goodsManager.html	_self	0	8	1
9	4	leftmenu	business	商品进货	fa fa-gear	resources/page/business/inport/inportManager.html	_self	0	9	1
10	4	leftmenu	business	商品退货查询	fa fa-gear	resources/page/business/outport/outportManager.html	_self	0	10	1
11	5	leftmenu	business	商品销售	fa fa-gear	resources/page/business/sales/salesManager.html	_self	0	11	1
12	5	leftmenu	business	销售退货查询	fa fa-gear	resources/page/business/salesback/salesbackManager.html	_self	0	12	1
13	2	leftmenu	system	系统管理	fa fa-gear		_self	0	13	1
14	2	leftmenu	system	其它管理	fa fa-gear		_self	0	14	1
15	13	leftmenu	system	部门管理	fa fa-gear	resources/page/system/dept/deptManager.html	_self	0	15	1
16	13	leftmenu	system	菜单管理	fa fa-gear	resources/page/system/menu/menuManager.html	_self	0	16	1
17	13	leftmenu	system	角色管理	fa fa-gear	resources/page/system/role/roleManager.html	_self	0	17	1
18	13	leftmenu	system	用户管理	fa fa-gear	resources/page/system/user/userManager.html	_self	0	18	1
19	14	leftmenu	system	登陆日志	fa fa-gear	resources/page/system/loginfo/loginfoManager.html	_self	0	19	1
20	14	leftmenu	system	数据源监控	fa fa-gear	http://www.sixiangxiang.com:8080/swagger-ui.html	_self	0	20	1
21	14	leftmenu	system	系统公告	fa fa-gear	resources/page/system/notice/noticeManager.html	_self	0	21	1
22	14	leftmenu	system	图标管理	fa fa-gear	resources/page/system/common/icon.html	_self	0	22	1
23	6	permission	customer:query	客户查询	NULL	NULL	_self	NULL	23	1
24	6	permission	customer:add	客户添加	NULL	NULL	_self	NULL	24	1
25	6	permission	customer:delete	客户删除	NULL	NULL	_self	NULL	25	1
26	6	permission	customer:update	客户更新	NULL	NULL	_self	NULL	26	1
32	15	permission	dept:add	部门添加			_self	0	27	1
33	15	permission	dept:update	部门修改			_self	0	28	1
34	15	permission	dept:delete	部门删除			_self	0	29	1
#+end_example





** check the database 
#+name: my-query
#+header: :engine mysql
#+header: :dbhost localhost
#+header: :dbuser root
#+header: :dbpassword "123456"
#+header: :database testforjava
#+begin_src sql
show tables;
#+end_src

#+RESULTS: my-query

** dump database

#+begin_src sh
  mysqldump -uroot -p123456 testforjava > ~/Desktop/mysql.sql
#+end_src

#+RESULTS:

** delete database
#+name: my-query1
#+header: :engine mysql
#+header: :dbhost localhost
#+header: :dbuser root
#+header: :dbpassword "123456"
#+begin_src sql
drop database testforjava;
show databases;
#+end_src

#+RESULTS: my-query1
| Database           |
|--------------------|
| information_schema |
| 0812erp            |
| mysql              |
| performance_schema |
| sys                |

** recover testforjava
#+name: my-query2
#+header: :engine mysql
#+header: :dbhost localhost
#+header: :dbuser root
#+header: :dbpassword "123456"
#+begin_src sql
create database testforjava;
use testforjava;
source ~/Desktop/mysql.sql
show databases;
#+end_src

#+RESULTS: my-query2
| Database           |
|--------------------|
| information_schema |
| 0812erp            |
| mysql              |
| performance_schema |
| sys                |
| testforjava        |

