mysql.html

<div id="outline-container-org65b15f2" class="outline-3">
<h3 id="org65b15f2">remote</h3>
<div class="outline-text-3" id="text-org65b15f2">
<p>
alter user 'root'@'localhost' indentified by '110011';
</p>
</div>
</div>
<div id="outline-container-org6b94b73" class="outline-3">
<h3 id="org6b94b73">reboot</h3>
<div class="outline-text-3" id="text-org6b94b73">
<p>
sudo systemctl restart mysql
</p>
</div>
</div>
</div>

<div id="outline-container-org439b2a5" class="outline-2">
<h2 id="org439b2a5">Operation</h2>
<div class="outline-text-2" id="text-org439b2a5">
</div>
<div id="outline-container-org8394e9b" class="outline-3">
<h3 id="org8394e9b">进入数据库</h3>
<div class="outline-text-3" id="text-org8394e9b">
<p>
create databese testforjava;
use testforjava;
</p>
</div>
</div>
<div id="outline-container-org2ece01b" class="outline-3">
<h3 id="org2ece01b">插入表格</h3>
<div class="outline-text-3" id="text-org2ece01b">
<p>
create table course(id int primary key atuo<sub>increment</sub>,  kurs<sub>name</sub> varchar(50), kurs<sub>length</sub>
varchar(50),teacher varchar(50), categeory varchar(50));
for later version, only works for auto<sub>increment</sub>, not for identity(m,n)
</p>
</div>
</div>
<div id="outline-container-orgfc129f7" class="outline-3">
<h3 id="orgfc129f7">插入值</h3>
<div class="outline-text-3" id="text-orgfc129f7">
<p>
insert into kurs values(1, 'C++', 23, 'su', 'basic');
insert into kurs values (2, 'Python', 50, 'morvan', 'hard');
insert into kurs values(3, 'CLI', 22, 'su', 'basic');
</p>


<p>
或者 不完整信息
</p>

<p>
insert into kurs(id, kurs<sub>name</sub>, categeory) values(4, 'java', 'basic'); 
(指定属性给值)
</p>
</div>
</div>
<div id="outline-container-orgc1e7f55" class="outline-3">
<h3 id="orgc1e7f55">查看表格</h3>
<div class="outline-text-3" id="text-orgc1e7f55">
<p>
show tables;
</p>

<p>
describe course;
</p>
</div>
</div>
<div id="outline-container-org7b04398" class="outline-3">
<h3 id="org7b04398">编辑表格</h3>
<div class="outline-text-3" id="text-org7b04398">
<p>
alter table course rename kurs;  (重命名)
</p>

<p>
alter table kurs add link varchar(50); (添加属性，列)
</p>

<p>
alter table kurs drop column link;   (将该列删除)
</p>

<p>
alter table kurs modify teacher varchar(100); (修改该列的属性，增加容量)
</p>

<p>
alter table kurs change column teacher lecture varchar(100); (修改该列的名称，和属性，)
</p>
</div>
</div>

<div id="outline-container-org61b41fc" class="outline-3">
<h3 id="org61b41fc">读取内容</h3>
<div class="outline-text-3" id="text-org61b41fc">
<p>
select * from kurs;
</p>

<p>
select kurs<sub>name</sub>, lecture from kurs;
</p>

<p>
读取内容时，不重复显示
</p>

<p>
select distinct lecture from kurs;
</p>
</div>
</div>

<div id="outline-container-org0b02687" class="outline-3">
<h3 id="org0b02687">高级条件查询</h3>
<div class="outline-text-3" id="text-org0b02687">
<p>
select * from course where course<sub>name</sub> = 'gnome';
</p>

<p>
select * from course where course<sub>length</sub> &gt; 10;
</p>

<p>
select * from course where lecture='su' and categeory='adv';
(满足这两个要求的)
select * from course order by  course<sub>length</sub> desc;
(由课程长度有小到大排序) 后面加desc 则反序排序
</p>
</div>
</div>
<div id="outline-container-org5986f3f" class="outline-3">
<h3 id="org5986f3f">delete</h3>
<div class="outline-text-3" id="text-org5986f3f">
<p>
delete from course where id =2;
delete from table where key=value
</p>
</div>
</div>
<div id="outline-container-org4e81ce4" class="outline-3">
<h3 id="org4e81ce4">update</h3>
<div class="outline-text-3" id="text-org4e81ce4">
<p>
update course set lecture = 'Lee'  where id =3;
</p>
</div>
</div>
<div id="outline-container-orgb9397b4" class="outline-3">
<h3 id="orgb9397b4">backup</h3>
<div class="outline-text-3" id="text-orgb9397b4">
<p>
mysqldump -u root -p kurs &gt; firstForFun.sql;
(在root下将kurs数据库备份为FirstForFun.sql)
</p>

<p>
mysql -u root -p kurs &lt; Firstforfun.sql
(将备份文件FirstForFun.sql恢复为kurs数据库)
</p>

<p>
(此两个语句是在退出sql后的terminal执行的)
</p>
</div>
</div>
</div>
<div id="outline-container-orge7a5b33" class="outline-2">
<h2 id="orge7a5b33">Management</h2>
<div class="outline-text-2" id="text-orge7a5b33">
</div>
<div id="outline-container-org95993f1" class="outline-3">
<h3 id="org95993f1">user</h3>
<div class="outline-text-3" id="text-org95993f1">
<p>
show databases;
use mysql;
show tables;
</p>

<p>
mysqld &#x2013;skip-grant-tables (开启mysql的无验证登陆，对于遗失密码后）
select host,user from user; (查看所有用户)
</p>

<p>
create user 'cloud'@'%' identified by 'password';
drop user 'root'@'%';
</p>

<p>
rename user si to shi; (将si重命名为shi)
set password = password('new');  (将当前用户密码改为new)
set password for si = password(link); (将si用户密码重置为link)
</p>

<p>
grant all privileges on <b><b>.</b></b> to 'cloud'@'%' with grant option;
flush privileges;
</p>
</div>
</div>

<div id="outline-container-org2008876" class="outline-3">
<h3 id="org2008876">privileges</h3>
<div class="outline-text-3" id="text-org2008876">
</div>
<div id="outline-container-org6b29465" class="outline-4">
<h4 id="org6b29465">creat</h4>
<div class="outline-text-4" id="text-org6b29465">
<p>
create user shi identified by 'lining';
grant all privileges on <b><b>.</b></b> to 'shi'@'%' identified by 'lining' with grant option;
flush privileges;
</p>

<p>
grant all privileges on <b><b>.</b></b> to 'root'@'%' identified by 'lining';
</p>
</div>
</div>
<div id="outline-container-orgf68b829" class="outline-4">
<h4 id="orgf68b829">查询</h4>
<div class="outline-text-4" id="text-orgf68b829">
<p>
show grants for 'newuser'@'localhost'
</p>
</div>
</div>
<div id="outline-container-org4b9b50d" class="outline-4">
<h4 id="org4b9b50d">授予</h4>
<div class="outline-text-4" id="text-org4b9b50d">
<p>
grants 权限列表 on 数据库名.表明 to '用户'@'主机名'
grants all on <b>.</b> 'newuser'@'localhost'
</p>
</div>
</div>
<div id="outline-container-org13bfcdc" class="outline-4">
<h4 id="org13bfcdc">撤销</h4>
<div class="outline-text-4" id="text-org13bfcdc">
<p>
revoke delete on <b>.</b> from 'newuser'@'localhost'
</p>
</div>
</div>
</div>

<div id="outline-container-org2168437" class="outline-3">
<h3 id="org2168437">timezone</h3>
<div class="outline-text-3" id="text-org2168437">
<p>
set global time<sub>zone</sub> = '+8:00';  ##修改mysql全局时区为北京时间，即我们所在的东8区
set time<sub>zone</sub> = '+8:00';  ##修改当前会话时区
flush privileges;  #立即生效
</p>
</div>
</div>
</div>
<div id="outline-container-org827117b" class="outline-2">
<h2 id="org827117b">Operations for SQL</h2>
<div class="outline-text-2" id="text-org827117b">
</div>
<div id="outline-container-org6208d8a" class="outline-3">
<h3 id="org6208d8a">decripation</h3>
<div class="outline-text-3" id="text-org6208d8a">
<p>
there can available code to execute,  change the dbhost and dbpassword
</p>
</div>
</div>
<div id="outline-container-orgce26a6a" class="outline-3">
<h3 id="orgce26a6a">check the connection in 0812erp</h3>
<div class="outline-text-3" id="text-orgce26a6a">
<div class="org-src-container">
<pre class="src src-sql" id="orge63ad14">show tables;
</pre>
</div>



<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> * <span style="font-weight: bold;">FROM</span> sys_menu          
</pre>
</div>
</div>
</div>


<div id="outline-container-orge460c45" class="outline-3">
<h3 id="orge460c45">check the database</h3>
<div class="outline-text-3" id="text-orge460c45">
<div class="org-src-container">
<pre class="src src-sql" id="orgf0d2ecf">show tables;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb47efd5" class="outline-3">
<h3 id="orgb47efd5">dump database</h3>
<div class="outline-text-3" id="text-orgb47efd5">
<div class="org-src-container">
<pre class="src src-sh">mysqldump -uroot -p123456 testforjava &gt; ~/Desktop/mysql.sql
</pre>
</div>
</div>
</div>

<div id="outline-container-org7162fbd" class="outline-3">
<h3 id="org7162fbd">delete database</h3>
<div class="outline-text-3" id="text-org7162fbd">
<div class="org-src-container">
<pre class="src src-sql" id="org28dd409"><span style="font-weight: bold;">drop</span> database testforjava;
show databases;
</pre>
</div>
</div>
</div>

<div id="outline-container-org20265fb" class="outline-3">
<h3 id="org20265fb">recover testforjava</h3>
<div class="outline-text-3" id="text-org20265fb">
<div class="org-src-container">
<pre class="src src-sql" id="orge7bf492"><span style="font-weight: bold;">create</span> database testforjava;
use testforjava;
<span style="font-weight: bold;">source</span> ~/Desktop/mysql.<span style="font-weight: bold;">sql</span>
show databases;
</pre>
</div>
</div>
</div>
