content/mysql.org
** Table creation update delete
#+header: :engine mysql
#+header: :dbhost localhost
#+header: :dbuser cloud
#+header: :dbpassword "password"
#+header: :database tuto
#+begin_src sql :results output
-- 班级表
CREATE TABLE classe(
	id INT PRIMARY KEY auto_increment,
	caption VARCHAR(30) COMMENT '班级名'
);

-- 学生表
CREATE TABLE student(
	id INT UNSIGNED PRIMARY KEY auto_increment,
	student_name CHAR(30) COMMENT '学生名',
	gender CHAR(30) DEFAULT NULL	COMMENT '学生性别',
	class_id INT DEFAULT NULL COMMENT '班级id'
);

-- 老师表
CREATE TABLE teacher(
	id INT UNSIGNED PRIMARY KEY auto_increment,
	teacher_name CHAR(30) COMMENT '教师名'
);

-- 课程表
CREATE TABLE course(
 id INT UNSIGNED PRIMARY KEY auto_increment,
 course_name CHAR(30) COMMENT '课程名',
 teacher_id INT DEFAULT NULL COMMENT'教师id'
);

-- 成绩表
CREATE TABLE score(
	id INT UNSIGNED PRIMARY KEY auto_increment,
	number INT DEFAULT NULL COMMENT '分数',
	student_id INT DEFAULT NULL COMMENT '学生id',
	course_id INT DEFAULT NULL COMMENT '课程id'
);
#+end_src

#+RESULTS:


#+header: :engine mysql
#+header: :dbhost localhost
#+header: :dbuser cloud
#+header: :dbpassword "password"
#+header: :database tuto
#+begin_src sql :results output
  drop table score;
  drop table student;
  drop table course;
  drop table classe;
  drop table teacher;
#+end_src

#+RESULTS:
          
  
  
  
 #+header: :engine mysql
 #+header: :dbhost localhost
 #+header: :dbuser cloud
 #+header: :dbpassword "password"
 #+header: :database tuto
 #+begin_src sql :results output
   INSERT INTO student (student_name, gender, class_id) VALUES ('张三', 'M', 1);
   INSERT INTO student (student_name, gender, class_id) VALUES ('李四', 'M', 2);
   -- INSERT INTO student (student_name, gender, class_id) VALUES ('王五', 'F', 4);  
   INSERT INTO classe (caption) VALUES ('一班');
   INSERT INTO classe (caption) VALUES ('二班');
   INSERT INTO classe (caption) VALUES ('三班');           
#+end_src          

#+RESULTS:

** add foreign key
add foreign key muss be careful, the references must exist,  such as
-- INSERT INTO student (student_name, gender, class_id) VALUES ('王五', 'F', 4);
will give error with add foreign key,
because there are no such item in classe with id=4!!!!


 #+header: :engine mysql
 #+header: :dbhost localhost
 #+header: :dbuser cloud
 #+header: :dbpassword "password"
 #+header: :database tuto
  #+begin_src sql :results output
    -- ALTER TABLE student DROP FOREIGN KEY student_class;
    ALTER TABLE student ADD 
    CONSTRAINT student_class 
    FOREIGN KEY (class_id) 
    REFERENCES classe(id)
    ON DELETE CASCADE
    ON UPDATE CASCADE;
    
#+end_src

#+RESULTS:



#+header: :engine mysql
#+header: :dbhost localhost
#+header: :dbuser cloud
#+header: :dbpassword "password"
#+header: :database tuto
#+begin_src sql :results output
DELETE FROM classe WHERE id=2;
#+end_src

#+RESULTS:


#+header: :engine mysql
#+header: :dbhost localhost
#+header: :dbuser cloud
#+header: :dbpassword "password"
#+header: :database tuto
#+begin_src sql :results output
UPDATE classe SET id=10 WHERE id=1;
#+end_src

#+RESULTS:

** left join
#+header: :engine mysql
#+header: :dbhost localhost
#+header: :dbuser cloud
#+header: :dbpassword "password"
#+header: :database tuto
#+begin_src sql :results output
select c.caption, s.student_name, s.gender from classe c left join student s on c.id=s.class_id;
#+end_src

** right join
#+header: :engine mysql
#+header: :dbhost localhost
#+header: :dbuser cloud
#+header: :dbpassword "password"
#+header: :database tuto
#+begin_src sql :results output
select c.caption, s.student_name, s.gender from classe c right join student s on c.id=s.class_id;
#+end_src

** inner join
#+header: :engine mysql
#+header: :dbhost localhost
#+header: :dbuser cloud
#+header: :dbpassword "password"
#+header: :database tuto
#+begin_src sql :results output
select c.caption, s.student_name, s.gender from classe c inner join student s on c.id=s.class_id;
#+end_src

** full joipn
#+header: :engine mysql
#+header: :dbhost localhost
#+header: :dbuser cloud
#+header: :dbpassword "password"
#+header: :database tuto
#+begin_src sql :results output
select * from classe left join student on classe.id=student.class_id union  select * from classe right join student on classe.id=student.class_id;          
#+end_src

#+RESULTS:
: id	caption	id	student_name	gender	class_id
: 1	一班	1	张三	M	1
: 2	二班	4	王五	F	2
: 2	二班	2	李四	M	2
: 3	三班	NULL	NULL	NULL	NULL

