mysql.html

<div id="outline-container-orgd4a5b7c" class="outline-3">
<h3 id="orgd4a5b7c">Table creation update delete</h3>
<div class="outline-text-3" id="text-orgd4a5b7c">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold; font-style: italic;">-- &#29677;&#32423;&#34920;</span>
<span style="font-weight: bold;">CREATE</span> <span style="font-weight: bold;">TABLE</span> <span style="font-weight: bold;">classe</span>(
        id <span style="font-weight: bold; text-decoration: underline;">INT</span> <span style="font-weight: bold;">PRIMARY</span> <span style="font-weight: bold;">KEY</span> auto_increment,
        caption <span style="font-weight: bold; text-decoration: underline;">VARCHAR</span>(30) COMMENT <span style="font-style: italic;">'&#29677;&#32423;&#21517;'</span>
);

<span style="font-weight: bold; font-style: italic;">-- &#23398;&#29983;&#34920;</span>
<span style="font-weight: bold;">CREATE</span> <span style="font-weight: bold;">TABLE</span> <span style="font-weight: bold;">student</span>(
        id <span style="font-weight: bold; text-decoration: underline;">INT</span> UNSIGNED <span style="font-weight: bold;">PRIMARY</span> <span style="font-weight: bold;">KEY</span> auto_increment,
        student_name <span style="font-weight: bold; text-decoration: underline;">CHAR</span>(30) COMMENT <span style="font-style: italic;">'&#23398;&#29983;&#21517;'</span>,
        gender <span style="font-weight: bold; text-decoration: underline;">CHAR</span>(30) <span style="font-weight: bold;">DEFAULT</span> <span style="font-weight: bold;">NULL</span>    COMMENT <span style="font-style: italic;">'&#23398;&#29983;&#24615;&#21035;'</span>,
        class_id <span style="font-weight: bold; text-decoration: underline;">INT</span> <span style="font-weight: bold;">DEFAULT</span> <span style="font-weight: bold;">NULL</span> COMMENT <span style="font-style: italic;">'&#29677;&#32423;id'</span>
);

<span style="font-weight: bold; font-style: italic;">-- &#32769;&#24072;&#34920;</span>
<span style="font-weight: bold;">CREATE</span> <span style="font-weight: bold;">TABLE</span> <span style="font-weight: bold;">teacher</span>(
        id <span style="font-weight: bold; text-decoration: underline;">INT</span> UNSIGNED <span style="font-weight: bold;">PRIMARY</span> <span style="font-weight: bold;">KEY</span> auto_increment,
        teacher_name <span style="font-weight: bold; text-decoration: underline;">CHAR</span>(30) COMMENT <span style="font-style: italic;">'&#25945;&#24072;&#21517;'</span>
);

<span style="font-weight: bold; font-style: italic;">-- &#35838;&#31243;&#34920;</span>
<span style="font-weight: bold;">CREATE</span> <span style="font-weight: bold;">TABLE</span> <span style="font-weight: bold;">course</span>(
 id <span style="font-weight: bold; text-decoration: underline;">INT</span> UNSIGNED <span style="font-weight: bold;">PRIMARY</span> <span style="font-weight: bold;">KEY</span> auto_increment,
 course_name <span style="font-weight: bold; text-decoration: underline;">CHAR</span>(30) COMMENT <span style="font-style: italic;">'&#35838;&#31243;&#21517;'</span>,
 teacher_id <span style="font-weight: bold; text-decoration: underline;">INT</span> <span style="font-weight: bold;">DEFAULT</span> <span style="font-weight: bold;">NULL</span> COMMENT<span style="font-style: italic;">'&#25945;&#24072;id'</span>
);

<span style="font-weight: bold; font-style: italic;">-- &#25104;&#32489;&#34920;</span>
<span style="font-weight: bold;">CREATE</span> <span style="font-weight: bold;">TABLE</span> <span style="font-weight: bold;">score</span>(
        id <span style="font-weight: bold; text-decoration: underline;">INT</span> UNSIGNED <span style="font-weight: bold;">PRIMARY</span> <span style="font-weight: bold;">KEY</span> auto_increment,
        <span style="font-weight: bold;">number</span> <span style="font-weight: bold; text-decoration: underline;">INT</span> <span style="font-weight: bold;">DEFAULT</span> <span style="font-weight: bold;">NULL</span> COMMENT <span style="font-style: italic;">'&#20998;&#25968;'</span>,
        student_id <span style="font-weight: bold; text-decoration: underline;">INT</span> <span style="font-weight: bold;">DEFAULT</span> <span style="font-weight: bold;">NULL</span> COMMENT <span style="font-style: italic;">'&#23398;&#29983;id'</span>,
        course_id <span style="font-weight: bold; text-decoration: underline;">INT</span> <span style="font-weight: bold;">DEFAULT</span> <span style="font-weight: bold;">NULL</span> COMMENT <span style="font-style: italic;">'&#35838;&#31243;id'</span>
);
</pre>
</div>


<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">drop</span> <span style="font-weight: bold;">table</span> <span style="font-weight: bold;">score</span>;
<span style="font-weight: bold;">drop</span> <span style="font-weight: bold;">table</span> <span style="font-weight: bold;">student</span>;
<span style="font-weight: bold;">drop</span> <span style="font-weight: bold;">table</span> <span style="font-weight: bold;">course</span>;
<span style="font-weight: bold;">drop</span> <span style="font-weight: bold;">table</span> <span style="font-weight: bold;">classe</span>;
<span style="font-weight: bold;">drop</span> <span style="font-weight: bold;">table</span> <span style="font-weight: bold;">teacher</span>;
</pre>
</div>




<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">INSERT</span> <span style="font-weight: bold;">INTO</span> student (student_name, gender, class_id) <span style="font-weight: bold;">VALUES</span> (<span style="font-style: italic;">'&#24352;&#19977;'</span>, <span style="font-style: italic;">'M'</span>, 1);
<span style="font-weight: bold;">INSERT</span> <span style="font-weight: bold;">INTO</span> student (student_name, gender, class_id) <span style="font-weight: bold;">VALUES</span> (<span style="font-style: italic;">'&#26446;&#22235;'</span>, <span style="font-style: italic;">'M'</span>, 2);
<span style="font-weight: bold; font-style: italic;">-- INSERT INTO student (student_name, gender, class_id) VALUES ('&#29579;&#20116;', 'F', 4);  </span>
<span style="font-weight: bold;">INSERT</span> <span style="font-weight: bold;">INTO</span> classe (caption) <span style="font-weight: bold;">VALUES</span> (<span style="font-style: italic;">'&#19968;&#29677;'</span>);
<span style="font-weight: bold;">INSERT</span> <span style="font-weight: bold;">INTO</span> classe (caption) <span style="font-weight: bold;">VALUES</span> (<span style="font-style: italic;">'&#20108;&#29677;'</span>);
<span style="font-weight: bold;">INSERT</span> <span style="font-weight: bold;">INTO</span> classe (caption) <span style="font-weight: bold;">VALUES</span> (<span style="font-style: italic;">'&#19977;&#29677;'</span>);           
</pre>
</div>
</div>
</div>

<div id="outline-container-org8ad155b" class="outline-3">
<h3 id="org8ad155b">add foreign key</h3>
<div class="outline-text-3" id="text-org8ad155b">
<p>
add foreign key muss be careful, the references must exist,  such as
&#x2013; INSERT INTO student (student<sub>name</sub>, gender, class<sub>id</sub>) VALUES ('王五', 'F', 4);
will give error with add foreign key,
because there are no such item in classe with id=4!!!!
</p>


<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold; font-style: italic;">-- ALTER TABLE student DROP FOREIGN KEY student_class;</span>
<span style="font-weight: bold;">ALTER</span> <span style="font-weight: bold;">TABLE</span> <span style="font-weight: bold;">student</span> <span style="font-weight: bold;">ADD</span> 
<span style="font-weight: bold;">CONSTRAINT</span> student_class 
<span style="font-weight: bold;">FOREIGN</span> <span style="font-weight: bold;">KEY</span> (class_id) 
<span style="font-weight: bold;">REFERENCES</span> classe(id)
<span style="font-weight: bold;">ON</span> <span style="font-weight: bold;">DELETE</span> <span style="font-weight: bold;">CASCADE</span>
<span style="font-weight: bold;">ON</span> <span style="font-weight: bold;">UPDATE</span> <span style="font-weight: bold;">CASCADE</span>;

</pre>
</div>



<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">DELETE</span> <span style="font-weight: bold;">FROM</span> classe <span style="font-weight: bold;">WHERE</span> id=2;
</pre>
</div>


<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">UPDATE</span> classe <span style="font-weight: bold;">SET</span> id=10 <span style="font-weight: bold;">WHERE</span> id=1;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf368143" class="outline-3">
<h3 id="orgf368143">left join</h3>
<div class="outline-text-3" id="text-orgf368143">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">select</span> c.caption, s.student_name, s.gender <span style="font-weight: bold;">from</span> classe c <span style="font-weight: bold;">left</span> <span style="font-weight: bold;">join</span> student s <span style="font-weight: bold;">on</span> c.id=s.class_id;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc9e139c" class="outline-3">
<h3 id="orgc9e139c">right join</h3>
<div class="outline-text-3" id="text-orgc9e139c">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">select</span> c.caption, s.student_name, s.gender <span style="font-weight: bold;">from</span> classe c <span style="font-weight: bold;">right</span> <span style="font-weight: bold;">join</span> student s <span style="font-weight: bold;">on</span> c.id=s.class_id;
</pre>
</div>
</div>
</div>

<div id="outline-container-org35d19ac" class="outline-3">
<h3 id="org35d19ac">inner join</h3>
<div class="outline-text-3" id="text-org35d19ac">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">select</span> c.caption, s.student_name, s.gender <span style="font-weight: bold;">from</span> classe c <span style="font-weight: bold;">inner</span> <span style="font-weight: bold;">join</span> student s <span style="font-weight: bold;">on</span> c.id=s.class_id;
</pre>
</div>
</div>
</div>

<div id="outline-container-org7f6a07d" class="outline-3">
<h3 id="org7f6a07d">full joipn</h3>
<div class="outline-text-3" id="text-org7f6a07d">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">select</span> * <span style="font-weight: bold;">from</span> classe <span style="font-weight: bold;">left</span> <span style="font-weight: bold;">join</span> student <span style="font-weight: bold;">on</span> classe.id=student.class_id <span style="font-weight: bold;">union</span>  <span style="font-weight: bold;">select</span> * <span style="font-weight: bold;">from</span> classe <span style="font-weight: bold;">right</span> <span style="font-weight: bold;">join</span> student <span style="font-weight: bold;">on</span> classe.id=student.class_id;          
</pre>
</div>
</div>
</div>
