content/mysql.org
** many2one
add more students to same class

 #+header: :engine mysql
 #+header: :dbhost localhost
 #+header: :dbuser cloud
 #+header: :dbpassword "password"
 #+header: :database tuto
 #+begin_src sql :results output
   INSERT INTO student (student_name, gender, class_id) VALUES ('张五', 'M', 1);
   INSERT INTO student (student_name, gender, class_id) VALUES ('李六', 'M', 2);
   INSERT INTO student (student_name, gender, class_id) VALUES ('李七', 'M', 1);
   INSERT INTO student (student_name, gender, class_id) VALUES ('李八', 'M', 1);
   INSERT INTO student (student_name, gender, class_id) VALUES ('李九', 'M', 1);
#+end_src          

#+RESULTS:


 #+header: :engine mysql
 #+header: :dbhost localhost
 #+header: :dbuser cloud
 #+header: :dbpassword "password"
 #+header: :database tuto
 #+begin_src sql :results output
SELECT c.caption ,COUNT(s.student_name) student_num 
FROM classe c LEFT JOIN student s ON c.id=s.class_id 
GROUP BY c.id;
#+end_src          

#+RESULTS:
: caption	student_num
: 一班	5
: 二班	3
: 三班	0



#+header: :engine mysql
#+header: :dbhost localhost
#+header: :dbuser cloud
#+header: :dbpassword "password"
#+header: :database tuto
#+begin_src sql :results output
select c.caption , s.student_name, s.gender from classe c left join student s on c.id=s.class_id;          
#+end_src

#+RESULTS:
#+begin_example
caption	student_name	gender
一班	张三	M
一班	张五	M
一班	李七	M
一班	李八	M
一班	李九	M
二班	李四	M
二班	王五	F
二班	李六	M
三班	NULL	NULL
#+end_example

** many2many
#+begin_src sql 
  CREATE TABLE tag(
  id INT UNSIGNED PRIMARY KEY auto_increment,
  tag_name VARCHAR(50) NOT NULL
  )
  
  CREATE TABLE article(
  id INT UNSIGNED PRIMARY KEY auto_increment,
  title VARCHAR(100) NOT NULL
  )
  
  CREATE TABLE tag_article(
  id INT UNSIGNED PRIMARY KEY auto_increment,
  tag_id INT UNSIGNED DEFAULT NULL,
  article_id INT UNSIGNED DEFAULT NULL,
  FOREIGN KEY(tag_id) REFERENCES tag(id) ON DELETE CASCADE ON UPDATE CASCADE,
  FOREIGN KEY(article_id) REFERENCES article(id) ON DELETE CASCADE ON UPDATE CASCADE,
  UNIQUE(tag_id,article_id)
  )
  
  
  SELECT a.title 
  FROM article a INNER JOIN tag_article t 
  ON a.id=t.article_id 
  WHERE tag_id=1
  
  
  
  
  
  
  
#+end_src

* Operation from the third program language
** singal python file connect with mysql 

#+begin_src python :results output
  import pymysql
  db = pymysql.connect("localhost", "root", "123456", "testforjava")
  cursor = db.cursor()
  sql = """create table  IF NOT EXISTS course(id int,  kurs_name varchar(50), kurs_length varchar(50),teacher varchar(50), categeory varchar(50))"""
  cursor.execute(sql)
  sql = """insert into course values(7, 'CLI', 22, 'su', 'basic')"""
  cursor.execute(sql)
  sql = """insert into course values(8, 'CLI', 22, 'su', 'basic')"""
  cursor.execute(sql)
  db.commit()

  sql1 = """select * from course"""
  cursor.execute(sql1)
  results = cursor.fetchall()
  print('\n')
  for row in results:
      num = row[0]
      name = row[1]
      age = row[2]
      right = row[3]
      dis = row[4]
      print("num is %7s, name is %7s, age is %7s, right is %7s, dis is %7s" %
            (num, name, age, right, dis))

  # if __name__ == "__main__":
  cursor.close()

#+end_src

#+RESULTS:

#+begin_src python :results output
from pymysql import connect
from pymysql.cursors import DictCursor


class Pymysqlconnection:
    def __init__(self):
        self.conn = connect(
            host='localhost',
            port=3306,
            user='cloud',
            password='password',
            database='0812erp'
        )
        self.cursor = self.conn.cursor(DictCursor)

    def __def__(self):
        self.cursor.close()
        self.conn.close()

    def get_item(self):
        sql = 'select * from sys_user'
        self.cursor.execute(sql)
        for temp in self.cursor.fetchall():
            print(temp)


if __name__ == '__main__':
    pymysqlconnection = Pymysqlconnection()
    pymysqlconnection.get_item()

#+end_src

#+RESULTS:

