mysql.html

<div id="outline-container-orgba2473b" class="outline-3">
<h3 id="orgba2473b">many2one</h3>
<div class="outline-text-3" id="text-orgba2473b">
<p>
add more students to same class
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">INSERT</span> <span style="font-weight: bold;">INTO</span> student (student_name, gender, class_id) <span style="font-weight: bold;">VALUES</span> (<span style="font-style: italic;">'&#24352;&#20116;'</span>, <span style="font-style: italic;">'M'</span>, 1);
<span style="font-weight: bold;">INSERT</span> <span style="font-weight: bold;">INTO</span> student (student_name, gender, class_id) <span style="font-weight: bold;">VALUES</span> (<span style="font-style: italic;">'&#26446;&#20845;'</span>, <span style="font-style: italic;">'M'</span>, 2);
<span style="font-weight: bold;">INSERT</span> <span style="font-weight: bold;">INTO</span> student (student_name, gender, class_id) <span style="font-weight: bold;">VALUES</span> (<span style="font-style: italic;">'&#26446;&#19971;'</span>, <span style="font-style: italic;">'M'</span>, 1);
<span style="font-weight: bold;">INSERT</span> <span style="font-weight: bold;">INTO</span> student (student_name, gender, class_id) <span style="font-weight: bold;">VALUES</span> (<span style="font-style: italic;">'&#26446;&#20843;'</span>, <span style="font-style: italic;">'M'</span>, 1);
<span style="font-weight: bold;">INSERT</span> <span style="font-weight: bold;">INTO</span> student (student_name, gender, class_id) <span style="font-weight: bold;">VALUES</span> (<span style="font-style: italic;">'&#26446;&#20061;'</span>, <span style="font-style: italic;">'M'</span>, 1);
</pre>
</div>


<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> c.caption ,<span style="font-weight: bold;">COUNT</span>(s.student_name) student_num 
<span style="font-weight: bold;">FROM</span> classe c <span style="font-weight: bold;">LEFT</span> <span style="font-weight: bold;">JOIN</span> student s <span style="font-weight: bold;">ON</span> c.id=s.class_id 
<span style="font-weight: bold;">GROUP</span> <span style="font-weight: bold;">BY</span> c.id;
</pre>
</div>



<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">select</span> c.caption , s.student_name, s.gender <span style="font-weight: bold;">from</span> classe c <span style="font-weight: bold;">left</span> <span style="font-weight: bold;">join</span> student s <span style="font-weight: bold;">on</span> c.id=s.class_id;          
</pre>
</div>
</div>
</div>

<div id="outline-container-org5ef4614" class="outline-3">
<h3 id="org5ef4614">many2many</h3>
<div class="outline-text-3" id="text-org5ef4614">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">CREATE</span> <span style="font-weight: bold;">TABLE</span> <span style="font-weight: bold;">tag</span>(
id <span style="font-weight: bold; text-decoration: underline;">INT</span> UNSIGNED <span style="font-weight: bold;">PRIMARY</span> <span style="font-weight: bold;">KEY</span> auto_increment,
tag_name <span style="font-weight: bold; text-decoration: underline;">VARCHAR</span>(50) <span style="font-weight: bold;">NOT</span> <span style="font-weight: bold;">NULL</span>
)

<span style="font-weight: bold;">CREATE</span> <span style="font-weight: bold;">TABLE</span> <span style="font-weight: bold;">article</span>(
id <span style="font-weight: bold; text-decoration: underline;">INT</span> UNSIGNED <span style="font-weight: bold;">PRIMARY</span> <span style="font-weight: bold;">KEY</span> auto_increment,
title <span style="font-weight: bold; text-decoration: underline;">VARCHAR</span>(100) <span style="font-weight: bold;">NOT</span> <span style="font-weight: bold;">NULL</span>
)

<span style="font-weight: bold;">CREATE</span> <span style="font-weight: bold;">TABLE</span> <span style="font-weight: bold;">tag_article</span>(
id <span style="font-weight: bold; text-decoration: underline;">INT</span> UNSIGNED <span style="font-weight: bold;">PRIMARY</span> <span style="font-weight: bold;">KEY</span> auto_increment,
tag_id <span style="font-weight: bold; text-decoration: underline;">INT</span> UNSIGNED <span style="font-weight: bold;">DEFAULT</span> <span style="font-weight: bold;">NULL</span>,
article_id <span style="font-weight: bold; text-decoration: underline;">INT</span> UNSIGNED <span style="font-weight: bold;">DEFAULT</span> <span style="font-weight: bold;">NULL</span>,
<span style="font-weight: bold;">FOREIGN</span> <span style="font-weight: bold;">KEY</span>(tag_id) <span style="font-weight: bold;">REFERENCES</span> tag(id) <span style="font-weight: bold;">ON</span> <span style="font-weight: bold;">DELETE</span> <span style="font-weight: bold;">CASCADE</span> <span style="font-weight: bold;">ON</span> <span style="font-weight: bold;">UPDATE</span> <span style="font-weight: bold;">CASCADE</span>,
<span style="font-weight: bold;">FOREIGN</span> <span style="font-weight: bold;">KEY</span>(article_id) <span style="font-weight: bold;">REFERENCES</span> article(id) <span style="font-weight: bold;">ON</span> <span style="font-weight: bold;">DELETE</span> <span style="font-weight: bold;">CASCADE</span> <span style="font-weight: bold;">ON</span> <span style="font-weight: bold;">UPDATE</span> <span style="font-weight: bold;">CASCADE</span>,
<span style="font-weight: bold;">UNIQUE</span>(tag_id,article_id)
)


<span style="font-weight: bold;">SELECT</span> a.title 
<span style="font-weight: bold;">FROM</span> article a <span style="font-weight: bold;">INNER</span> <span style="font-weight: bold;">JOIN</span> tag_article t 
<span style="font-weight: bold;">ON</span> a.id=t.article_id 
<span style="font-weight: bold;">WHERE</span> tag_id=1







</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga8db5b3" class="outline-2">
<h2 id="orga8db5b3">Operation from the third program language</h2>
<div class="outline-text-2" id="text-orga8db5b3">
</div>
<div id="outline-container-org459a7ce" class="outline-3">
<h3 id="org459a7ce">singal python file connect with mysql</h3>
<div class="outline-text-3" id="text-org459a7ce">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> pymysql
<span style="font-weight: bold; font-style: italic;">db</span> = pymysql.connect(<span style="font-style: italic;">"localhost"</span>, <span style="font-style: italic;">"root"</span>, <span style="font-style: italic;">"123456"</span>, <span style="font-style: italic;">"testforjava"</span>)
<span style="font-weight: bold; font-style: italic;">cursor</span> = db.cursor()
<span style="font-weight: bold; font-style: italic;">sql</span> = <span style="font-style: italic;">"""create table  IF NOT EXISTS course(id int,  kurs_name varchar(50), kurs_length varchar(50),teacher varchar(50), categeory varchar(50))"""</span>
cursor.execute(sql)
<span style="font-weight: bold; font-style: italic;">sql</span> = <span style="font-style: italic;">"""insert into course values(7, 'CLI', 22, 'su', 'basic')"""</span>
cursor.execute(sql)
<span style="font-weight: bold; font-style: italic;">sql</span> = <span style="font-style: italic;">"""insert into course values(8, 'CLI', 22, 'su', 'basic')"""</span>
cursor.execute(sql)
db.commit()

<span style="font-weight: bold; font-style: italic;">sql1</span> = <span style="font-style: italic;">"""select * from course"""</span>
cursor.execute(sql1)
<span style="font-weight: bold; font-style: italic;">results</span> = cursor.fetchall()
<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'\n'</span>)
<span style="font-weight: bold;">for</span> row <span style="font-weight: bold;">in</span> results:
    <span style="font-weight: bold; font-style: italic;">num</span> = row[0]
    <span style="font-weight: bold; font-style: italic;">name</span> = row[1]
    <span style="font-weight: bold; font-style: italic;">age</span> = row[2]
    <span style="font-weight: bold; font-style: italic;">right</span> = row[3]
    <span style="font-weight: bold; font-style: italic;">dis</span> = row[4]
    <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"num is %7s, name is %7s, age is %7s, right is %7s, dis is %7s"</span> %
          (num, name, age, right, dis))

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">if __name__ == "__main__":</span>
cursor.close()

</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> pymysql <span style="font-weight: bold;">import</span> connect
<span style="font-weight: bold;">from</span> pymysql.cursors <span style="font-weight: bold;">import</span> DictCursor


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Pymysqlconnection</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">self</span>.conn = connect(
            host=<span style="font-style: italic;">'localhost'</span>,
            port=3306,
            user=<span style="font-style: italic;">'cloud'</span>,
            password=<span style="font-style: italic;">'password'</span>,
            database=<span style="font-style: italic;">'0812erp'</span>
        )
        <span style="font-weight: bold;">self</span>.cursor = <span style="font-weight: bold;">self</span>.conn.cursor(DictCursor)

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__def__</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">self</span>.cursor.close()
        <span style="font-weight: bold;">self</span>.conn.close()

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">get_item</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold; font-style: italic;">sql</span> = <span style="font-style: italic;">'select * from sys_user'</span>
        <span style="font-weight: bold;">self</span>.cursor.execute(sql)
        <span style="font-weight: bold;">for</span> temp <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.cursor.fetchall():
            <span style="font-weight: bold;">print</span>(temp)


<span style="font-weight: bold;">if</span> <span style="font-weight: bold;">__name__</span> == <span style="font-style: italic;">'__main__'</span>:
    <span style="font-weight: bold; font-style: italic;">pymysqlconnection</span> = Pymysqlconnection()
    pymysqlconnection.get_item()

</pre>
</div>
</div>
</div>
