content/mysql.org
** singal java  file  connect with mysql

#+begin_src java   :classname JavaConnSQL :results output :dir ~/Desktop/
  import java.sql.*;
  public class JavaConnSQL
  {
      static final String JDBC_DRIVER = "com.mysql.cj.jdbc.Driver";  
      static final String DB_URL = "jdbc:mysql://localhost:3306/testforjava?useSSL=false&serverTimezone=UTC";
      static final String USER = "root";
      static final String PASS = "123456";
      public static void main( String[] args )
      {
          System.out.println( "Hello World!" );
          System.out.println("在dir中生成的代码， 如果dir中有驱动，则可以执行mysql的连接");
          System.out.println("提前执行");
          System.out.println("export CLASSPATH=mysql-connector-java-8.0.20.jar:. ");
          Connection conn = null;
          Statement stmt = null;
          try{
              Class.forName(JDBC_DRIVER);
              System.out.println("连接数据库...");
              conn = DriverManager.getConnection(DB_URL,USER,PASS);

              System.out.println(" 实例化Statement对象...");
              stmt = conn.createStatement();
              String sql;
              sql = "SELECT id, kurs_name FROM course";
              ResultSet rs = stmt.executeQuery(sql);

              while(rs.next()){
                  int id  = rs.getInt("id");
                  String name = rs.getString("kurs_name");
                  // 输出数据
                  System.out.print("ID: " + id);
                  System.out.print(", kurs name 站点名称: " + name);
                  System.out.print("\n");
              }
              rs.close();
              stmt.close();
              conn.close();
          }catch(SQLException se){
              // 处理 JDBC 错误
              se.printStackTrace();
          }catch(Exception e){
              // 处理 Class.forName 错误
              e.printStackTrace();
          }
      }
  }

#+end_src

#+RESULTS:
: Hello World!
: 在dir中生成的代码， 如果dir中有驱动，则可以执行mysql的连接
: 提前执行
: export CLASSPATH=mysql-connector-java-8.0.20.jar:. 

* Footnotes
[fn:nopasswordset]  此后，电脑的root用户将不能登陆，而此时电脑的普通,  用户可以登陆，但是没有设置密码，不能用 -p 登陆

