mysql.html

<div id="outline-container-orga20f590" class="outline-3">
<h3 id="orga20f590">singal java  file  connect with mysql</h3>
<div class="outline-text-3" id="text-orga20f590">
<div class="org-src-container">
<pre class="src src-java"><span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">java</span>.<span style="font-weight: bold; text-decoration: underline;">sql</span>.*;
<span style="font-weight: bold;">public</span> <span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">JavaConnSQL</span>
{
    <span style="font-weight: bold;">static</span> <span style="font-weight: bold;">final</span> <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">JDBC_DRIVER</span> = <span style="font-style: italic;">"com.mysql.cj.jdbc.Driver"</span>;  
    <span style="font-weight: bold;">static</span> <span style="font-weight: bold;">final</span> <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">DB_URL</span> = <span style="font-style: italic;">"jdbc:mysql://localhost:3306/testforjava?useSSL=false&amp;serverTimezone=UTC"</span>;
    <span style="font-weight: bold;">static</span> <span style="font-weight: bold;">final</span> <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">USER</span> = <span style="font-style: italic;">"root"</span>;
    <span style="font-weight: bold;">static</span> <span style="font-weight: bold;">final</span> <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">PASS</span> = <span style="font-style: italic;">"123456"</span>;
    <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">main</span>( <span style="font-weight: bold; text-decoration: underline;">String</span>[] <span style="font-weight: bold; font-style: italic;">args</span> )
    {
        System.out.println( <span style="font-style: italic;">"Hello World!"</span> );
        System.out.println(<span style="font-style: italic;">"&#22312;dir&#20013;&#29983;&#25104;&#30340;&#20195;&#30721;&#65292; &#22914;&#26524;dir&#20013;&#26377;&#39537;&#21160;&#65292;&#21017;&#21487;&#20197;&#25191;&#34892;mysql&#30340;&#36830;&#25509;"</span>);
        System.out.println(<span style="font-style: italic;">"&#25552;&#21069;&#25191;&#34892;"</span>);
        System.out.println(<span style="font-style: italic;">"export CLASSPATH=mysql-connector-java-8.0.20.jar:. "</span>);
        <span style="font-weight: bold; text-decoration: underline;">Connection</span> <span style="font-weight: bold; font-style: italic;">conn</span> = <span style="font-weight: bold; text-decoration: underline;">null</span>;
        <span style="font-weight: bold; text-decoration: underline;">Statement</span> <span style="font-weight: bold; font-style: italic;">stmt</span> = <span style="font-weight: bold; text-decoration: underline;">null</span>;
        <span style="font-weight: bold;">try</span>{
            Class.forName(JDBC_DRIVER);
            System.out.println(<span style="font-style: italic;">"&#36830;&#25509;&#25968;&#25454;&#24211;..."</span>);
            conn = DriverManager.getConnection(DB_URL,USER,PASS);

            System.out.println(<span style="font-style: italic;">" &#23454;&#20363;&#21270;Statement&#23545;&#35937;..."</span>);
            stmt = conn.createStatement();
            <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">sql</span>;
            sql = <span style="font-style: italic;">"SELECT id, kurs_name FROM course"</span>;
            <span style="font-weight: bold; text-decoration: underline;">ResultSet</span> <span style="font-weight: bold; font-style: italic;">rs</span> = stmt.executeQuery(sql);

            <span style="font-weight: bold;">while</span>(rs.next()){
                <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">id</span>  = rs.getInt(<span style="font-style: italic;">"id"</span>);
                <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">name</span> = rs.getString(<span style="font-style: italic;">"kurs_name"</span>);
                <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#36755;&#20986;&#25968;&#25454;</span>
                System.out.print(<span style="font-style: italic;">"ID: "</span> + id);
                System.out.print(<span style="font-style: italic;">", kurs name &#31449;&#28857;&#21517;&#31216;: "</span> + name);
                System.out.print(<span style="font-style: italic;">"\n"</span>);
            }
            rs.close();
            stmt.close();
            conn.close();
        }<span style="font-weight: bold;">catch</span>(<span style="font-weight: bold; text-decoration: underline;">SQLException</span> <span style="font-weight: bold; font-style: italic;">se</span>){
            <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#22788;&#29702; JDBC &#38169;&#35823;</span>
            se.printStackTrace();
        }<span style="font-weight: bold;">catch</span>(<span style="font-weight: bold; text-decoration: underline;">Exception</span> <span style="font-weight: bold; font-style: italic;">e</span>){
            <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#22788;&#29702; Class.forName &#38169;&#35823;</span>
            e.printStackTrace();
        }
    }
}

</pre>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
此后，电脑的root用户将不能登陆，而此时电脑的普通,  用户可以登陆，但是没有设置密码，不能用 -p 登陆
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Created: 2022-02-18 Fri 16:18</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"></p>
</div>
</body>
</html>
